
// data for about page
export const textDataForAboutPage = [
    '"БукЛайф" — это приложение, предназначенное для любителей читать книги. Мы уже живём в новом, цифровом мире, где информация пронизывает буквально всё. Но не вся информация оказывается для нас полезной, большая её часть только создаёт ещё больший беспорядок в нашей голове. К тому же, многие в наши дни недооценивают пользу книг и считают, что в современности они устарели и не несут никакой пользы.',

    'Создатели этого приложения не согласны с данной позицией.Мы отчётливо полагаем, что польза от книг не просто ощутима, но даже велика для современного человека. Что, как не книга позволит вам "поговорить" с главными умами человечества разных эпох? Что, как не книга заставит вас погрузиться в новый, непонятный мир, полный угроз и неожиданностей? В конце концов, что как не книга даст современному человеку возможность приостановиться в бурном потоке мыслей, сосредоточиться на конкретной идее, посмотреть вглубь самого себя?',

    'Почему столько людей стали жертвами стереотипов, которые звучат на подобии: "Куда мне эти книги, я итак целый день читаю...". Вопрос здесь кроется в том, что этот человек читает? Подборки политических новостей, каждая больше другой разящая подробностями и фактами событий, которые зачастую напрямую никак не связаны с этим человеком. Или ещё лучше: новостные ленты социальных сетей, кишащие "мемами" и прочими продуктами человеческой деградации.',

    'Некоторые скажут: "Да книга же тоже самое. Чему она учит? Пробовал я читать книгу "А" и там просто какой-то скучный персонаж описывает свою скучную жизнь". Скажем так, не каждая книга учит нас какому-то конкретному навыку, который мы ежедневно применяем на практике. Это типичное заблуждение начинающих, неопытных чтецов. Но тут вы спросите, а чему же она учит и учит ли вообще?',

    'Ответить на этот вопрос можно по-разному, можно также сказать, что понимание самой книги зависит от многих факторов, таких как восприятие и интеллект самого читателя и прочее. Но мы всё же постараемся ответить не взирая на эти факторы: практически каждая книга - это опыт. Что же такое этот опыт и чем он может быть нам интересен, если у нас и так полно своего жизненного опыта?',

    'С нашей точки зрения, опыт - это фундаментальный критерий развития и прогресса любого человека. Где бы оказался человеческий вид, если бы ему не удалось изобрести письменность и передавать свои знания от поколения к поколению? Где бы мы были без знания пережитого опыта наших предков, полного ошибок, успехов, фактов, законов, переживаний? Благодаря опыту и знаниям предыдущих поколений, мы избегаем множество ошибок, которые могли быть совершены нами, и которые несли бы различные последствия, в том числе и ужасные.',

    'Миссия этого приложения - помочь людям получить доступ к лучшим книгам, которые доступны человечеству сегодня. Авторы приложили большие усилия для его создания, чтобы у вас, как пользователей была возможность читать эти книги, в удобном интерфейсе и на любом устройстве.',
    
    'Мы верим, что каждое чтение — это шаг на пути к новым знаниям и открытиям. Именно поэтому мы создали "БукЛайф" — чтобы каждый, кто любит чтение, мог найти здесь что-то новое, интересное и вдохновляющее.',
    'Читайте книги и становитесь лучше.',
];