import { AuthorInterface } from '@/interfaces/storage/authorInterface';

export const authorsData: AuthorInterface[] = [
    {
        name: 'виктор гюго',
        books: [
            {
                title: 'Отверженные',
                year: '1862 г.',
                description: `Отверженные - это роман-эпопея, написанная Виктором Гюго и впервые опубликованная в 1862 году. Этот роман считается одним из величайших произведений XIX века и широко признан мировой литературной критикой и общественностью. Сюжет романа вплетает множество тем и мотивов, включая социальную несправедливость, бедность, несправедливое обращение с нищими и отверженными членами общества, а также мотив прощения и искупления.`,
                genres: ['Роман', 'Биография', 'Антиутопия', 'Триллер', 'Фантастика'],
                quotes: [
                    'Все люди равны перед законом, но не все равны перед природой',
                    'Никто не может быть свободным, если другие не свободны.',
                    'Нельзя быть счастливым, если ты не спасаешь других.'
                ],
                thumbnail: '/thumbs/отверженные.jpg',
                picture: '/thumbs/отверженные.jpg',
                // TEMP FILE PATH
                // mb use import.meta.url
                file: `./src/booksStorage/srcs/books/test2.txt`,
            },
            {
                title: 'Отверженные',
                year: '1862 г.',
                description: `Отверженные - это роман-эпопея, написанная Виктором Гюго и впервые опубликованная в 1862 году. Этот роман считается одним из величайших произведений XIX века и широко признан мировой литературной критикой и общественностью. Сюжет романа вплетает множество тем и мотивов, включая социальную несправедливость, бедность, несправедливое обращение с нищими и отверженными членами общества, а также мотив прощения и искупления.`,
                genres: ['Роман', 'Биография', 'Антиутопия', 'Триллер', 'Фантастика'],
                quotes: [
                    'Все люди равны перед законом, но не все равны перед природой',
                    'Никто не может быть свободным, если другие не свободны.',
                    'Нельзя быть счастливым, если ты не спасаешь других.'
                ],
                thumbnail: '/thumbs/отверженные.jpg',
                picture: '/thumbs/отверженные.jpg',
                // TEMP FILE PATH
                file: `./src/booksStorage/srcs/books/test2.txt`,
            },
            {
                title: 'Отверженные',
                year: '1862 г.',
                description: `Отверженные - это роман-эпопея, написанная Виктором Гюго и впервые опубликованная в 1862 году. Этот роман считается одним из величайших произведений XIX века и широко признан мировой литературной критикой и общественностью. Сюжет романа вплетает множество тем и мотивов, включая социальную несправедливость, бедность, несправедливое обращение с нищими и отверженными членами общества, а также мотив прощения и искупления.`,
                genres: ['Роман', 'Биография', 'Антиутопия', 'Триллер', 'Фантастика'],
                quotes: [
                    'Все люди равны перед законом, но не все равны перед природой',
                    'Никто не может быть свободным, если другие не свободны.',
                    'Нельзя быть счастливым, если ты не спасаешь других.'
                ],
                thumbnail: '/thumbs/отверженные.jpg',
                picture: '/thumbs/отверженные.jpg',
                // TEMP FILE PATH
                file: `./src/booksStorage/srcs/books/test2.txt`,
            },
            {
                title: 'Отверженные',
                year: '1862 г.',
                description: `Отверженные - это роман-эпопея, написанная Виктором Гюго и впервые опубликованная в 1862 году. Этот роман считается одним из величайших произведений XIX века и широко признан мировой литературной критикой и общественностью. Сюжет романа вплетает множество тем и мотивов, включая социальную несправедливость, бедность, несправедливое обращение с нищими и отверженными членами общества, а также мотив прощения и искупления.`,
                genres: ['Роман', 'Биография', 'Антиутопия', 'Триллер', 'Фантастика'],
                quotes: [
                    'Все люди равны перед законом, но не все равны перед природой',
                    'Никто не может быть свободным, если другие не свободны.',
                    'Нельзя быть счастливым, если ты не спасаешь других.'
                ],
                thumbnail: '/thumbs/отверженные.jpg',
                picture: '/thumbs/отверженные.jpg',
                // TEMP FILE PATH
                file: `./src/booksStorage/srcs/books/test2.txt`,
            },
            {
                title: 'Отверженные',
                year: '1862 г.',
                description: `Отверженные - это роман-эпопея, написанная Виктором Гюго и впервые опубликованная в 1862 году. Этот роман считается одним из величайших произведений XIX века и широко признан мировой литературной критикой и общественностью. Сюжет романа вплетает множество тем и мотивов, включая социальную несправедливость, бедность, несправедливое обращение с нищими и отверженными членами общества, а также мотив прощения и искупления.`,
                genres: ['Роман', 'Биография', 'Антиутопия', 'Триллер', 'Фантастика'],
                quotes: [
                    'Все люди равны перед законом, но не все равны перед природой',
                    'Никто не может быть свободным, если другие не свободны.',
                    'Нельзя быть счастливым, если ты не спасаешь других.'
                ],
                thumbnail: '/thumbs/отверженные.jpg',
                picture: '/thumbs/отверженные.jpg',
                // TEMP FILE PATH
                file: `./src/booksStorage/srcs/books/test2.txt`,
            },
            {
                title: 'Отверженные',
                year: '1862 г.',
                description: `Отверженные - это роман-эпопея, написанная Виктором Гюго и впервые опубликованная в 1862 году. Этот роман считается одним из величайших произведений XIX века и широко признан мировой литературной критикой и общественностью. Сюжет романа вплетает множество тем и мотивов, включая социальную несправедливость, бедность, несправедливое обращение с нищими и отверженными членами общества, а также мотив прощения и искупления.`,
                genres: ['Роман', 'Биография', 'Антиутопия', 'Триллер', 'Фантастика'],
                quotes: [
                    'Все люди равны перед законом, но не все равны перед природой',
                    'Никто не может быть свободным, если другие не свободны.',
                    'Нельзя быть счастливым, если ты не спасаешь других.'
                ],
                thumbnail: '/thumbs/отверженные.jpg',
                picture: '/thumbs/отверженные.jpg',
                // TEMP FILE PATH
                file: `./src/booksStorage/srcs/books/test2.txt`,
            },
            {
                title: 'Отверженные',
                year: '1862 г.',
                description: `Отверженные - это роман-эпопея, написанная Виктором Гюго и впервые опубликованная в 1862 году. Этот роман считается одним из величайших произведений XIX века и широко признан мировой литературной критикой и общественностью. Сюжет романа вплетает множество тем и мотивов, включая социальную несправедливость, бедность, несправедливое обращение с нищими и отверженными членами общества, а также мотив прощения и искупления.`,
                genres: ['Роман', 'Биография', 'Антиутопия', 'Триллер', 'Фантастика'],
                quotes: [
                    'Все люди равны перед законом, но не все равны перед природой',
                    'Никто не может быть свободным, если другие не свободны.',
                    'Нельзя быть счастливым, если ты не спасаешь других.'
                ],
                thumbnail: '/thumbs/отверженные.jpg',
                picture: '/thumbs/отверженные.jpg',
                // TEMP FILE PATH
                file: `./src/booksStorage/srcs/books/test2.txt`,
            },
        ],
    },
    {
        name: 'фёдор достоевский',
        books: [
            {
                title: 'Война и мир',
                year: '1869 г.',
                description: 'Война и мир - это эпический роман Льва Николаевича Толстого, охватывающий период войны против Наполеона в России с 1805 по 1812 годы. Роман описывает жизнь многих персонажей, включая важных исторических фигур, таких как Наполеон и Кутузов, а также обычных людей, живущих в то время. Книга известна своей сложной структурой и детальным изображением социальных, политических и личных отношений в России того времени',
                genres: ['Роман', 'Биография', 'Антиутопия', 'Триллер', 'Фантастика'],
                quotes: [
                    'Все люди знают, что они умрут, но не все понимают, что они живут.',
                    'Быть великим - значит, знать, что ты ничего не знаешь.',
                    'Жизнь - это как путешествие, которое продолжается, и ты не знаешь, куда тебя ведут.',
                ],
                thumbnail: '/thumbs/человекКоторыйСмеётся.jpg',
                picture: '/thumbs/отверженные.jpg',
                // TEMP FILE PATH
                file: `./src/booksStorage/srcs/books/test2.txt`,
            }
        ],
    },
    {
        name: 'лев толстой',
        books: [
            {
                title: 'Идиот',
                year: '1868 г.',
                description: 'Идиот" - это психологический роман, описывающий жизнь главного героя, князя Мышкина, и его взаимодействия с различными персонажами в обществе. Главный герой представлен как человек, полностью лишенный самолюбия, но неспособный влиять на окружающих людей, несмотря на свою способность видеть их духовные качества.',
                genres: ['Роман', 'Биография', 'Антиутопия', 'Триллер', 'Фантастика'],
                quotes: [     
                    "Нельзя жить, как будто бы ничего не было, и не думать о том, что есть.",
                    "Я не хочу, чтобы они были счастливы, я хочу, чтобы они были мои.",
                    "Я не могу быть без тебя, ты мне нужна, как света, чтобы видеть.",
                ],
                thumbnail: '/thumbs/человекКоторыйСмеётся.jpg',
                picture: '/thumbs/отверженные.jpg',
                // TEMP FILE PATH
                file: `./src/booksStorage/srcs/books/test2.txt`,
            }
        ],
    }
];